# 176. Second Highest Salary
<div><p>Table: <code>Employee</code></p>

<pre>+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| salary      | int  |
+-------------+------+
id is the primary key column for this table.
Each row of this table contains information about the salary of an employee.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query to report the second highest salary from the <code>Employee</code> table. If there is no second highest salary, the query should report <code>null</code>.</p>

<p>The query result format is in the following example.</p>

<p>&nbsp;</p>
<p><strong>Example 1:</strong></p>

<pre><strong>Input:</strong> 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
<strong>Output:</strong> 
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
</pre>

<p><strong>Example 2:</strong></p>

<pre><strong>Input:</strong> 
Employee table:
+----+--------+
| id | salary |
+----+--------+
| 1  | 100    |
+----+--------+
<strong>Output:</strong> 
+---------------------+
| SecondHighestSalary |
+---------------------+
| null                |
+---------------------+
</pre>
</div>

In [12]:
import sqlite3

cnx = sqlite3.connect("test.db")
cursor = cnx.cursor()

cursor.execute("CREATE TABLE IF NOT EXISTS Employee (Id int, Salary int)") 
cursor.execute("INSERT INTO Employee (Id, Salary) VALUES (1, 100),(2,200), (3,300)") 
cnx.commit()

In [2]:
query="SELECT Salary as SecondHighestSalary FROM Employee ORDER BY Salary DESC LIMIT 1 OFFSET 1"

cursor.execute(query)
for row in cursor:
    print(row)

(200,)

In [3]:
# cursor.execute("DROP TABLE Employee")

# 178. Rank Scores

<div><p>Table: <code>Scores</code></p>

<pre>+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| score       | decimal |
+-------------+---------+
id is the primary key for this table.
Each row of this table contains the score of a game. Score is a floating point value with two decimal places.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query to rank the scores. The ranking should be calculated according to the following rules:</p>

<ul>
	<li>The scores should be ranked from the highest to the lowest.</li>
	<li>If there is a tie between two scores, both should have the same ranking.</li>
	<li>After a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no holes between ranks.</li>
</ul>

<p>Return the result table ordered by <code>score</code> in descending order.</p>

<p>The query result format is in the following example.</p>

<p>&nbsp;</p>
<p><strong>Example 1:</strong></p>

<pre><strong>Input:</strong> 
Scores table:
+----+-------+
| id | score |
+----+-------+
| 1  | 3.50  |
| 2  | 3.65  |
| 3  | 4.00  |
| 4  | 3.85  |
| 5  | 4.00  |
| 6  | 3.65  |
+----+-------+
<strong>Output:</strong> 
+-------+------+
| score | rank |
+-------+------+
| 4.00  | 1    |
| 4.00  | 1    |
| 3.85  | 2    |
| 3.65  | 3    |
| 3.65  | 3    |
| 3.50  | 4    |
+-------+------+
</pre>
</div>

cursor.execute("CREATE TABLE IF NOT EXISTS Scores (Id int, score real)") 
cursor.execute("INSERT INTO Scores (Id, score) VALUES (1, 3.50),(2,3.65), (3,4.00), (4, 3.85), (5,4.00), (6,3.65)") 
cnx.commit()

In [28]:
query="SELECT score, DENSE_RANK() OVER (ORDER BY score DESC) as 'RANK' FROM Scores"

cursor.execute(query)
for row in cursor:
    print(row)

(4.0, 1)
(4.0, 1)
(3.85, 2)
(3.65, 3)
(3.65, 3)
(3.5, 4)

# 180. Consecutive Numbers
<div><p>Table: <code>Logs</code></p>

<pre>+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| num         | varchar |
+-------------+---------+
id is the primary key for this table.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query to find all numbers that appear at least three times consecutively.</p>

<p>Return the result table in <strong>any order</strong>.</p>

<p>The query result format is in the following example.</p>

<p>&nbsp;</p>
<p><strong>Example 1:</strong></p>

<pre><strong>Input:</strong> 
Logs table:
+----+-----+
| id | num |
+----+-----+
| 1  | 1   |
| 2  | 1   |
| 3  | 1   |
| 4  | 2   |
| 5  | 1   |
| 6  | 2   |
| 7  | 2   |
+----+-----+
<strong>Output:</strong> 
+-----------------+
| ConsecutiveNums |
+-----------------+
| 1               |
+-----------------+
<strong>Explanation:</strong> 1 is the only number that appears consecutively for at least three times.
</pre>
</div>

cursor.execute("CREATE TABLE IF NOT EXISTS Logs (Id int, Num int)") 
cursor.execute("INSERT INTO Logs (Id, Num) VALUES (1,1),(2,1), (3,1), (4,2), (5,1), (6,2),(7,2)") 
cnx.commit()

In [4]:
query='''SELECT DISTINCT a.Num as ConsecutiveNums FROM Logs a 
JOIN Logs b ON a.id = b.id+1 
JOIN Logs c ON a.id = c.id+2
WHERE a.Num = b.Num and a.Num = c.Num'''

cursor.execute(query)
for row in cursor:
    print(row)

(1,)

In [22]:
query = '''
SELECT Num ConsecutiveNums FROM
(SELECT *
        , LEAD(Num, 1) OVER (ORDER BY id) nxt
        , LEAD(Num, 2) OVER (ORDER BY id) nxt2
 FROM Logs) cte
WHERE cte.Num = cte.nxt = cte.nxt2
'''
cursor.execute(query)
for row in cursor:
    print(row)

(1,)

# 181. Employees Earning More Than Their Managers
<div><p>Table: <code>Employee</code></p>

<pre>+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
| salary      | int     |
| managerId   | int     |
+-------------+---------+
id is the primary key column for this table.
Each row of this table indicates the ID of an employee, their name, salary, and the ID of their manager.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query to find the employees who earn more than their managers.</p>

<p>Return the result table in <strong>any order</strong>.</p>

<p>The query result format is in the following example.</p>

<p>&nbsp;</p>
<p><strong>Example 1:</strong></p>

<pre><strong>Input:</strong> 
Employee table:
+----+-------+--------+-----------+
| id | name  | salary | managerId |
+----+-------+--------+-----------+
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | Null      |
| 4  | Max   | 90000  | Null      |
+----+-------+--------+-----------+
<strong>Output:</strong> 
+----------+
| Employee |
+----------+
| Joe      |
+----------+
<strong>Explanation:</strong> Joe is the only employee who earns more than his manager.
</pre>
</div>

cursor.execute("CREATE TABLE IF NOT EXISTS Employee2 (Id int, Name text, Salary int, ManagerId int)") 
cursor.execute("INSERT INTO Employee2 (Id, Name, Salary, ManagerId) VALUES (1,'Joe',70000,3),(2,'Henry',80000,4), (3,'Sam',60000,NULL), (4,'Max',90000,NULL)") 
cnx.commit()

In [5]:
query = '''SELECT a.Name FROM Employee2 a 
JOIN Employee2 b ON a.ManagerId = b.Id
WHERE a.Salary > b.Salary'''

cursor.execute(query)
for row in cursor:
    print(row)

('Joe',)

# 182. Duplicate Emails
<div><p>Table: <code>Person</code></p>

<pre>+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| email       | varchar |
+-------------+---------+
id is the primary key column for this table.
Each row of this table contains an email. The emails will not contain uppercase letters.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query to report all the duplicate emails.</p>

<p>Return the result table in <strong>any order</strong>.</p>

<p>The query result format is in the following example.</p>

<p>&nbsp;</p>
<p><strong>Example 1:</strong></p>

<pre><strong>Input:</strong> 
Person table:
+----+---------+
| id | email   |
+----+---------+
| 1  | a@b.com |
| 2  | c@d.com |
| 3  | a@b.com |
+----+---------+
<strong>Output:</strong> 
+---------+
| Email   |
+---------+
| a@b.com |
+---------+
<strong>Explanation:</strong> a@b.com is repeated two times.
</pre>
</div>

cursor.execute("CREATE TABLE IF NOT EXISTS Person (Id int, Email text)") 
cursor.execute("INSERT INTO Person (Id, Email) VALUES (1, 'a@b.com'),(2,'c@d.com'), (3,'a@b.com')") 
cnx.commit()

In [6]:
query = "SELECT Email FROM (SELECT * , count(Id) as 'count' FROM Person GROUP BY Email) WHERE count > 1"
cursor.execute(query)
for row in cursor:
    print(row)

('a@b.com',)

# 183. Customers Who Never Order
<div><p>Table: <code>Customers</code></p>

<pre>+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
+-------------+---------+
id is the primary key column for this table.
Each row of this table indicates the ID and name of a customer.
</pre>

<p>&nbsp;</p>

<p>Table: <code>Orders</code></p>

<pre>+-------------+------+
| Column Name | Type |
+-------------+------+
| id          | int  |
| customerId  | int  |
+-------------+------+
id is the primary key column for this table.
customerId is a foreign key of the ID from the Customers table.
Each row of this table indicates the ID of an order and the ID of the customer who ordered it.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query to report all customers who never order anything.</p>

<p>Return the result table in <strong>any order</strong>.</p>

<p>The query result format is in the following example.</p>

<p>&nbsp;</p>
<p><strong>Example 1:</strong></p>

<pre><strong>Input:</strong> 
Customers table:
+----+-------+
| id | name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+
Orders table:
+----+------------+
| id | customerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+
<strong>Output:</strong> 
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+
</pre>
</div>

cursor.execute("CREATE TABLE IF NOT EXISTS Customers (Id int, Name text)") 
cursor.execute("CREATE TABLE IF NOT EXISTS Orders (Id int, CustomerId int)") 

cursor.execute("INSERT INTO Customers (Id, Name) VALUES (1, 'Joe'),(2,'Henry'), (3,'Sam'), (4, 'Max')")
cursor.execute("INSERT INTO Orders (Id, CustomerId) VALUES (1, 3),(2,1)")
cnx.commit()

In [7]:
query = '''SELECT NAME FROM Customers c 
LEFT JOIN Orders o ON c.id = o.CustomerId
WHERE CustomerId IS NULL'''
cursor.execute(query)
for row in cursor:
    print(row)

('Henry',)
('Max',)

# 184. Department Highest Salary
<div><p>Table: <code>Employee</code></p>

<pre>+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| id           | int     |
| name         | varchar |
| salary       | int     |
| departmentId | int     |
+--------------+---------+
id is the primary key column for this table.
departmentId is a foreign key of the ID from the <code>Department </code>table.
Each row of this table indicates the ID, name, and salary of an employee. It also contains the ID of their department.
</pre>

<p>&nbsp;</p>

<p>Table: <code>Department</code></p>

<pre>+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
+-------------+---------+
id is the primary key column for this table.
Each row of this table indicates the ID of a department and its name.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query to find employees who have the highest salary in each of the departments.</p>

<p>Return the result table in <strong>any order</strong>.</p>

<p>The query result format is in the following example.</p>

<p>&nbsp;</p>
<p><strong>Example 1:</strong></p>

<pre><strong>Input:</strong> 
Employee table:
+----+-------+--------+--------------+
| id | name  | salary | departmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2  | Jim   | 90000  | 1            |
| 3  | Henry | 80000  | 2            |
| 4  | Sam   | 60000  | 2            |
| 5  | Max   | 90000  | 1            |
+----+-------+--------+--------------+
Department table:
+----+-------+
| id | name  |
+----+-------+
| 1  | IT    |
| 2  | Sales |
+----+-------+
<strong>Output:</strong> 
+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Jim      | 90000  |
| Sales      | Henry    | 80000  |
| IT         | Max      | 90000  |
+------------+----------+--------+
<strong>Explanation:</strong> Max and Jim both have the highest salary in the IT department and Henry has the highest salary in the Sales department.
</pre>
</div>

cursor.execute("CREATE TABLE IF NOT EXISTS Employee3 (id int, name text, salary int, departmentId int)") 
cursor.execute("CREATE TABLE IF NOT EXISTS Department (id int, name text)") 

cursor.execute("INSERT INTO Employee3 (id, name, salary, departmentId) VALUES (1, 'Joe', 70000, 1),(2,'Jim',90000,1), (3,'Henry',80000,2), (4, 'Sam',60000,2), (5,'Max', 90000, 1)")
cursor.execute("INSERT INTO Department (id, name) VALUES (1, 'IT'),(2,'Sales')")
cnx.commit()

In [15]:
query = '''
SELECT d.Name Department, e.Name Employee, e.Salary FROM Employee3 e 
JOIN Department d ON e.DepartmentId = d.Id
WHERE (DepartmentId, Salary) IN 
(SELECT DepartmentId, max(Salary) FROM Employee3 
GROUP BY DepartmentId)
'''
cursor.execute(query)
for row in cursor:
    print(row)

('IT', 'Jim', 90000)
('Sales', 'Henry', 80000)
('IT', 'Max', 90000)

# 185. Department Top Three Salaries
<div><p>Table: <code>Employee</code></p>

<pre>+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| id           | int     |
| name         | varchar |
| salary       | int     |
| departmentId | int     |
+--------------+---------+
id is the primary key column for this table.
departmentId is a foreign key of the ID from the <code>Department </code>table.
Each row of this table indicates the ID, name, and salary of an employee. It also contains the ID of their department.
</pre>

<p>&nbsp;</p>

<p>Table: <code>Department</code></p>

<pre>+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| name        | varchar |
+-------------+---------+
id is the primary key column for this table.
Each row of this table indicates the ID of a department and its name.
</pre>

<p>&nbsp;</p>

<p>A company's executives are interested in seeing who earns the most money in each of the company's departments. A <strong>high earner</strong> in a department is an employee who has a salary in the <strong>top three unique</strong> salaries for that department.</p>

<p>Write an SQL query to find the employees who are <strong>high earners</strong> in each of the departments.</p>

<p>Return the result table <strong>in any order</strong>.</p>

<p>The query result format is in the following example.</p>

<p>&nbsp;</p>
<p><strong>Example 1:</strong></p>

<pre><strong>Input:</strong> 
Employee table:
+----+-------+--------+--------------+
| id | name  | salary | departmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 85000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
| 5  | Janet | 69000  | 1            |
| 6  | Randy | 85000  | 1            |
| 7  | Will  | 70000  | 1            |
+----+-------+--------+--------------+
Department table:
+----+-------+
| id | name  |
+----+-------+
| 1  | IT    |
| 2  | Sales |
+----+-------+
<strong>Output:</strong> 
+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Max      | 90000  |
| IT         | Joe      | 85000  |
| IT         | Randy    | 85000  |
| IT         | Will     | 70000  |
| Sales      | Henry    | 80000  |
| Sales      | Sam      | 60000  |
+------------+----------+--------+
<strong>Explanation:</strong> 
In the IT department:
- Max earns the highest unique salary
- Both Randy and Joe earn the second-highest unique salary
- Will earns the third-highest unique salary

In the Sales department:
- Henry earns the highest salary
- Sam earns the second-highest salary
- There is no third-highest salary as there are only two employees
</pre>
</div>

cursor.execute("CREATE TABLE IF NOT EXISTS Employee4 (Id int, Name text, Salary int, DepartmentId int)") 
cursor.execute("INSERT INTO Employee4 (Id, Name, Salary, DepartmentId) VALUES (1, 'Joe', 85000, 1), (2,'Henry',80000,2), (3, 'Sam',60000,2), (4,'Max', 90000, 1), (5,'Janet',69000, 1), (6,'Randy',85000,1),(7,'Will',70000,1)")
cnx.commit()

In [20]:
query = '''
SELECT d.name "Department", e.Name, Salary FROM
(SELECT *, Dense_RANK() over 
(partition by DepartmentId order by Salary DESC) rank FROM Employee4) e
JOIN Department d ON e.departmentId=d.id
WHERE rank <=3 ORDER BY Department, Salary DESC
'''
cursor.execute(query)
for row in cursor:
    print(row)

('IT', 'Max', 90000)
('IT', 'Joe', 85000)
('IT', 'Randy', 85000)
('IT', 'Will', 70000)
('Sales', 'Henry', 80000)
('Sales', 'Sam', 60000)

# 197. Rising Temperature
<div><p>Table: <code>Weather</code></p>

<pre>+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| id            | int     |
| recordDate    | date    |
| temperature   | int     |
+---------------+---------+
id is the primary key for this table.
This table contains information about the temperature on a certain day.
</pre>

<p>&nbsp;</p>

<p>Write an SQL query to find all dates' <code>Id</code> with higher temperatures compared to its previous dates (yesterday).</p>

<p>Return the result table in <strong>any order</strong>.</p>

<p>The query result format is in the following example.</p>

<p>&nbsp;</p>
<p><strong>Example 1:</strong></p>

<pre><strong>Input:</strong> 
Weather table:
+----+------------+-------------+
| id | recordDate | temperature |
+----+------------+-------------+
| 1  | 2015-01-01 | 10          |
| 2  | 2015-01-02 | 25          |
| 3  | 2015-01-03 | 20          |
| 4  | 2015-01-04 | 30          |
+----+------------+-------------+
<strong>Output:</strong> 
+----+
| id |
+----+
| 2  |
| 4  |
+----+
<strong>Explanation:</strong> 
In 2015-01-02, the temperature was higher than the previous day (10 -&gt; 25).
In 2015-01-04, the temperature was higher than the previous day (20 -&gt; 30).
</pre>
</div>

cursor.execute("CREATE TABLE IF NOT EXISTS Weather (Id int, recordDate text, Temperature int)") 
cursor.execute("INSERT INTO Weather (Id, recordDate, Temperature) VALUES (1, '2015-01-01', 10), (2,'2015-01-02',25), (3, '2015-01-03',20), (4,'2015-01-04', 30)")
cnx.commit()

In [21]:
query = '''
SELECT w1.Id FROM Weather w1 
JOIN Weather w2 ON JULIANDAY(w1.recordDate) = JULIANDAY(w2.recordDate)+1
WHERE w1.Temperature > w2.Temperature
'''
cursor.execute(query)
for row in cursor:
    print(row)

(2,)
(4,)

In [10]:
cnx.close()